Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
#if defined(CONFIG_BOOTLOADER_MCUBOOT)
    /*
     * A no-op with the current update path: serial recovery writes slot0 in
     * place, so the image already counts as confirmed on its first boot. It is
     * kept because uploading to the secondary slot instead would make the image
     * a test image, and then reaching this line - display up, sensor probed,
     * BLE running - is exactly the evidence worth confirming on.
     */
    if (!boot_is_img_confirmed()) {
        if (boot_write_img_confirmed() == 0) {
            ESP_LOGI(TAG, "Image confirmed; MCUboot will keep it");
        } else {
            ESP_LOGE(TAG, "Could not confirm image; MCUboot will revert it");
        }
    }
#endif

    previous_charger_attached = charger_is_attached();
    pet_behavior_post(&pet, PET_EVENT_BOOT_COMPLETED,
                      (uint32_t)(uptime_us() / 1000));

    previous_frame_us = uptime_us();
    while (true) {
        /* Preserve convenient USB reflashing after the SoC is moved. */
        usb_dfu_touch_poll();
        now_us = uptime_us();
        float frame_seconds =
            (float)(now_us - previous_frame_us) / MICROSECONDS_PER_SECOND;
        /* Do not inject a huge physics step after USB/BLE delays. */
        if (frame_seconds < 0.001f || frame_seconds > 0.1f) {
            frame_seconds = 0.025f;
        }
        previous_frame_us = now_us;
        const uint32_t now_ms = (uint32_t)(now_us / 1000);
        motion_state_t current_state = motion_state_get(&state_machine);

        /* Plugging in USB on this PCB means the charger started working. */
        const bool charger_attached = charger_is_attached();
        if (charger_attached != previous_charger_attached) {
            previous_charger_attached = charger_attached;
#if MOTION_DEBUG
            /* The cable is back and someone is watching: hand over the log. */
            if (charger_attached) {
                motion_history_dump();
            }
#endif
            pet_behavior_post(&pet,
                              charger_attached ? PET_EVENT_CHARGER_ATTACHED
                                               : PET_EVENT_CHARGER_DETACHED,
                              now_ms);
        }

        /* Both I2C devices may be connected after boot; retry without reset. */
        if (!oled_display_is_available() &&
            now_us - last_display_probe_us >= HARDWARE_RETRY_INTERVAL_US) {
            last_display_probe_us = now_us;
            if (oled_display_init() == ESP_OK) {
                ESP_LOGI(TAG, "OLED connected after boot");
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
        }

        if (!mpu6050_is_available() &&
            now_us - last_sensor_probe_us >= HARDWARE_RETRY_INTERVAL_US) {
            last_sensor_probe_us = now_us;
            if (mpu6050_init() == ESP_OK) {
                ESP_LOGI(TAG, "Accelerometer connected after boot");
                sensorless_ble_announced = false;
                previous_tilt_zone = 0;
                motion_detector_init(&detector, now_us,
                                     MOTION_MOVEMENT_DELTA_THRESHOLD,
                                     MOTION_SHAKE_DELTA_THRESHOLD,
                                     MOTION_SHAKE_COUNT_REQUIRED,
                                     MOTION_SHAKE_WINDOW_US,
                                     SLEEP_STILLNESS_TIMEOUT_US);
                phone_sync_stop_advertising();
            }
        }

        /* With no accelerometer there is no triple-shake gesture. */
        if (phone_sync_available && !mpu6050_is_available() &&
            now_us - last_sensorless_ble_request_us >=
                SENSORLESS_BLE_RETRY_US) {
            last_sensorless_ble_request_us = now_us;
            if (phone_sync_request_advertising() == ESP_OK &&
                !sensorless_ble_announced) {
                /*
                 * Advertising is retried every few seconds here, so the pet is
                 * told only once: otherwise it would restart the looking-for-
                 * the-phone animation forever and never show anything else.
                 */
                sensorless_ble_announced = true;
                pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_OPEN, now_ms);
            }
        }

        if (phone_sync_window_active &&
            now_us >= phone_sync_window_deadline_us) {
            phone_sync_stop_advertising();
            phone_sync_window_active = false;
            pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_CLOSED, now_ms);
            ESP_LOGI(TAG, "Phone sync window expired");
        }

        if (phone_sync_available && phone_sync_take_connected_event()) {
            pet_behavior_post(&pet, PET_EVENT_PHONE_CONNECTED, now_ms);
        }

        phone_sync_command_t command;
        if (phone_sync_available && phone_sync_get_command(&command) &&
            command == PHONE_SYNC_COMMAND_START_GAME) {
            phone_sync_window_active = false;
            phone_sync_stop_advertising();
            k_sleep(K_MSEC(PHONE_SYNC_SHUTDOWN_GRACE_MS));
            (void)phone_sync_shutdown();

            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, MOTION_EVENT_GAME_REQUESTED, true, now_us);
            breakout_game_start(&game, now_us, sys_rand32_get(), last_tilt_x);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
            ESP_LOGW(TAG, "Breakout started from phone command");
        }

        device_clock_datetime_t phone_datetime;
        if (phone_sync_available &&
            phone_sync_get_datetime_update(&phone_datetime)) {
            device_clock_set_datetime(&clock, &phone_datetime, now_us);
            if (step_counter_get_date_key(&steps) !=
                device_clock_date_key(&phone_datetime)) {
                step_counter_init(&steps,
                                  device_clock_date_key(&phone_datetime));
            }
            phone_sync_window_active = false;
            phone_sync_stop_advertising();
            k_sleep(K_MSEC(PHONE_SYNC_SHUTDOWN_GRACE_MS));
            (void)phone_sync_shutdown();

            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, MOTION_EVENT_TIME_REQUESTED, true, now_us);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            } else if (current_state == MOTION_STATE_TIME) {
                previous_time_frame_us = 0;
            }
            pet_behavior_post(&pet, PET_EVENT_PHONE_SYNCED, now_ms);
            ESP_LOGW(TAG, "Clock synchronized from phone");
        }

