Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
        if (current_state == MOTION_STATE_TIME &&
            now_us - motion_state_entered_at_us(&state_machine) >=
                TIME_STATE_DURATION_US) {
            const bool movement_recent = !mpu6050_is_available() ||
                motion_detector_has_recent_movement(&detector, now_us);
            (void)motion_state_handle_event(&state_machine,
                                            MOTION_EVENT_TIME_TIMEOUT,
                                            movement_recent, now_us);
            current_state = motion_state_get(&state_machine);
            apply_state_entry_actions(current_state, now_us,
                                      &previous_frame_us,
                                      &previous_sleep_frame_us,
                                      &previous_time_frame_us);
        }

        mpu6050_accel_data_t raw_data = {0, 0, 256};
        motion_detector_result_t detector_result = {0};
        motion_event_t event = MOTION_EVENT_NONE;
        bool sensor_sample_valid = false;
        if (mpu6050_is_available()) {
            if (mpu6050_read_accel(&raw_data) == ESP_OK) {
                sensor_sample_valid = true;
                device_clock_get_datetime(&clock, now_us, &datetime);
                step_counter_update(&steps, &raw_data,
                                    device_clock_date_key(&datetime), now_us);
                detector_result = motion_detector_update(
                    &detector, &raw_data, now_us);
                event = detector_result_to_event(&detector_result);
            } else {
                ESP_LOGW(TAG, "Accelerometer disconnected; continuing safely");
                last_sensor_probe_us = now_us;
                if (current_state == MOTION_STATE_SLEEP) {
                    current_state = motion_state_handle_event(
                        &state_machine, MOTION_EVENT_MOVEMENT_DETECTED,
                        true, now_us);
                    apply_state_entry_actions(current_state, now_us,
                                              &previous_frame_us,
                                              &previous_sleep_frame_us,
                                              &previous_time_frame_us);
                }
            }
        }

        /* A single jolt startles the pet even when it is not a full gesture. */
        if (sensor_sample_valid && detector_result.shake_peak &&
            !detector_result.shake_detected) {
            pet_behavior_post(&pet, PET_EVENT_JOLT, now_ms);
        }

        if (sensor_sample_valid && event == MOTION_EVENT_SHAKE_DETECTED) {
            /* The pet reacts to being shaken whatever the screen is doing. */
            pet_behavior_post(&pet, PET_EVENT_SHAKEN, now_ms);
            if (current_state == MOTION_STATE_GAME) {
                current_state = motion_state_handle_event(
                    &state_machine, MOTION_EVENT_GAME_FINISHED, true, now_us);
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
            if (!phone_sync_window_active && phone_sync_available &&
                phone_sync_request_advertising() == ESP_OK) {
                phone_sync_window_active = true;
                phone_sync_window_deadline_us = now_us + PHONE_SYNC_WINDOW_US;
                pet_behavior_post(&pet, PET_EVENT_PHONE_WINDOW_OPEN, now_ms);
                ESP_LOGW(TAG, "Triple shake: BLE window open for 60 seconds");
            }
        } else if (sensor_sample_valid && event != MOTION_EVENT_NONE) {
            /*
             * Movement that ends a SLEEP means the keychain was picked up; the
             * same event during normal use only keeps the idle timers reset.
             */
            if (event == MOTION_EVENT_MOVEMENT_DETECTED) {
                pet_behavior_post(&pet,
                                  (current_state == MOTION_STATE_SLEEP)
                                      ? PET_EVENT_PICKED_UP
                                      : PET_EVENT_MOVEMENT,
                                  now_ms);
            }
            const motion_state_t previous_state = current_state;
            current_state = motion_state_handle_event(
                &state_machine, event,
                motion_detector_has_recent_movement(&detector, now_us), now_us);
            if (current_state != previous_state) {
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
        }

        float tilt_x;
        float tilt_y;
        if (sensor_sample_valid) {
            tilt_x = mpu6050_accel_to_g(raw_data.x);
            tilt_y = mpu6050_accel_to_g(raw_data.y);
        } else {
            /* A triangle wave keeps FLUID and GAME visibly testable. */
            demo_tilt += (float)demo_direction * 0.02f;
            if (demo_tilt >= 0.7f || demo_tilt <= -0.7f) {
                demo_direction = -demo_direction;
            }
            tilt_x = demo_tilt;
            tilt_y = 0.35f;
        }
        last_tilt_x = tilt_x;

        /*
         * Map the accelerometer's axes onto how the keychain is actually held.
         *
         * Measured by holding the board tilted to the right: Y swung from -13
         * to +196 counts while X moved by a third of that and in the opposite
         * sense. So Y is the left-right axis with positive to the right, and X
         * is the one that responds to tipping it towards or away from you.
         * Which axis is which is a property of how the part sits on the board,
         * so it can only come from a measurement like this one.
         */
        const float tilt_side = tilt_y;
        const float tilt_pitch = tilt_x;

