Godcomplexx/Keychain_motion/xiao_nrf52840/src/main.c
        /*
         * Hold it steeply tipped to ask for the particles. The latch makes the
         * gesture fire once per tip rather than continuously while held.
         */
        /*
         * Measured across both horizontal axes rather than along X alone. The
         * keychain does not rest perfectly flat, so a single-axis threshold is
         * nearly reached in one direction and unreachable in the other; the
         * combined tilt asks the same thing of every direction.
         */
        const float sideways = sensor_sample_valid
            ? sqrtf(tilt_x * tilt_x + tilt_y * tilt_y) : 0.0f;
        if (PLAY_GESTURE_ENABLED && sensor_sample_valid &&
            sideways >= PLAY_GESTURE_TILT_G) {
            if (play_gesture_started_us == 0) {
                play_gesture_started_us = now_us;
                /* Say so, so a tip that is deep enough but too brief is
                 * distinguishable from one that never got deep enough. */
                ESP_LOGI(TAG, "Play gesture: tilted far enough (%.2f g), hold",
                         (double)sideways);
            } else if (!play_gesture_fired &&
                       now_us - play_gesture_started_us >=
                           PLAY_GESTURE_HOLD_US) {
                play_gesture_fired = true;
                pet_behavior_post(&pet, PET_EVENT_PLAY_REQUESTED, now_ms);
                ESP_LOGI(TAG, "Play gesture: particles requested (%.2f g)",
                         (double)sideways);
            }
        } else {
            play_gesture_started_us = 0;
            play_gesture_fired = false;
        }

        /*
         * A hardware edge on ACC_INT1 means the sensor itself decided the
         * keychain moved, which is exactly the "picked up" moment.
         */
        if (accel_int_take()) {
            pet_behavior_post(&pet, PET_EVENT_PICKED_UP, now_ms);
        }

        /* Only a real sensor produces a tilt gesture; the demo wave must not. */
        if (sensor_sample_valid) {
            const int zone = tilt_zone(tilt_side, previous_tilt_zone);
            if (zone != previous_tilt_zone && zone != 0) {
                pet_behavior_post(&pet,
                                  (zone < 0) ? PET_EVENT_TILT_LEFT
                                             : PET_EVENT_TILT_RIGHT,
                                  now_ms);
            }
            previous_tilt_zone = zone;
        }

        if (battery_is_available() &&
            now_us - last_battery_sample_us >= BATTERY_SAMPLE_INTERVAL_US) {
            last_battery_sample_us = now_us;
            battery_reading_t reading;
            if (battery_sample(&reading, charger_attached)) {
                battery_percent = reading.percent;
                battery_millivolts = reading.cell_millivolts;
                /*
                 * Only on a change: a line every ten seconds forever buries
                 * everything else. The pin figure is kept because that is what
                 * the divider ratio would be corrected from.
                 */
                if (reading.percent != last_logged_percent) {
                    last_logged_percent = reading.percent;
                    ESP_LOGI(TAG,
                             "Battery: pin=%d mV cell=%d mV resting=%d mV -> %u%%",
                             reading.pin_millivolts, reading.cell_millivolts,
                             reading.resting_millivolts,
                             (unsigned)reading.percent);
                }
            }
        }

        const pet_context_t pet_context = {
            .sensor_present = mpu6050_is_available(),
            .charging = charger_attached,
            .battery_percent = battery_percent,
            .battery_millivolts = battery_millivolts,
            /* Only a real sensor may steer the gaze; the demo wave must not. */
            .tilt_x = sensor_sample_valid ? (int8_t)smoothed_tilt_x : 0,
            .tilt_y = sensor_sample_valid ? (int8_t)smoothed_tilt_y : 0,
            .upside_down = upside_down,
            .being_rocked = being_rocked,
        };
        pet_behavior_update(&pet, &pet_context, now_ms);
        const pet_view_t *pet_view = pet_behavior_view(&pet);
        if (pet_view->id != previous_pet_id) {
            if (pet_view->id == PET_ACT_FLUID) {
                /* Start the particle activity from a clean, known state. */
                flip_animation_reset();
            }
            ESP_LOGI(TAG, "pet: %s -> %s priority=P%d bond=%u",
                     pet_behavior_name(previous_pet_id),
                     pet_behavior_name(pet_view->id),
                     (int)pet_view->priority, (unsigned)pet_view->bond);
            previous_pet_id = pet_view->id;
        }

        if (sensor_sample_valid && frames_until_log == 0) {
            ESP_LOGI(TAG, "State=%s event=%s steps=%lu raw=%d,%d,%d",
                     motion_state_name(current_state),
                     motion_event_name(event),
                     (unsigned long)step_counter_get_steps_today(&steps),
                     raw_data.x, raw_data.y, raw_data.z);
            frames_until_log = RAW_LOG_INTERVAL_FRAMES;
        }
        if (frames_until_log > 0) --frames_until_log;

        esp_err_t render_err = ESP_OK;
        switch (current_state) {
        case MOTION_STATE_FLUID:
            if (oled_display_is_available()) {
                /*
                 * The companion owns the active screen. FLIP is still here, but
                 * now as one of the activities the pet picks when left alone.
                 */
                render_err = (pet_view->id == PET_ACT_FLUID)
                    ? flip_animation_render(tilt_x, tilt_y, frame_seconds)
                    : pet_face_render(pet_view, now_ms);
            }
            log_render_error("FLUID", render_err);
            k_sleep(K_MSEC(ACTIVE_FRAME_DELAY_MS));
            break;
        case MOTION_STATE_SLEEP:
            render_err = render_pet_sleep_frame_if_due(
                now_us, &previous_sleep_frame_us, pet_view,
                tilt_x, tilt_y, frame_seconds);
            log_render_error("SLEEP", render_err);
            k_sleep(K_MSEC(LOW_POWER_LOOP_DELAY_MS));
            break;
        case MOTION_STATE_TIME:
            render_err = render_time_frame_if_due(
                now_us, motion_state_entered_at_us(&state_machine),
                &previous_time_frame_us, &clock, &steps);
            log_render_error("TIME", render_err);
            k_sleep(K_MSEC(LOW_POWER_LOOP_DELAY_MS));
            break;
        case MOTION_STATE_GAME: {
            bool game_finished = false;
            render_err = breakout_game_update_and_render(
                &game, tilt_x, frame_seconds, now_us, &game_finished);
            log_render_error("GAME", render_err);
            if (game_finished) {
                current_state = motion_state_handle_event(
                    &state_machine, MOTION_EVENT_GAME_FINISHED, true, now_us);
                apply_state_entry_actions(current_state, now_us,
                                          &previous_frame_us,
                                          &previous_sleep_frame_us,
                                          &previous_time_frame_us);
            }
            k_sleep(K_MSEC(GAME_FRAME_DELAY_MS));
            break;
        }
        default:
            ESP_LOGE(TAG, "Unknown motion state; restarting FLUID state");
            motion_state_init(&state_machine, now_us);
            break;
        }
    }

    return 0;
}
